// <-------- კალკულატორი -------#### //

/*
    აქ უნდა შევქმნათ კალკულატორი იუზერისთვის,
    თავიდან იუზერს, prompt-ით უნდა ჩააწერინოთ ხუთი რიცხვი(და იფებით უნდა დაჩეკოთ ნამდვილად ჩაწერა თუ არა რიცხვი)
    მაგ ხუთი რიცხვის შემდეგ უნდა ჩააწერინოთ რა არითმეტიკული მოქმედება გააკეთოს ჩვენმა კალკულატორმა,
    (აქ შეუძლია ჩაწეროს მარტო '-','+','*' თუ სხვა რამეს ჩაწერს ახლიდან ამოუგდეთ სანამ არ ჩაწერს ამ სამიდან ერთ-ერთს)
    ამ პრომპტებიდან ხუთი მიღებული რიცხვი უნდა ჩასეტოთ მასივში და ერთ ცვლადში უნდა გქონდეთ რა არითმეტიკული მოქმედება უნდა ჩავატაროთ(რაც იუზერი აარჩევს).
    შემდეგ უნდა შექმნათ ფუნქცია რმელიც მიიღებს 2 პარამეტრს პირვილი იქნება მასივი და მეორე არითმეტიკული მოქმედება, და მაგ ფუნქციამ არითმეტიკული მნიშვნელობის მიხედვით უნდა
    გააკეთოს გამოთვლა თუ '+' არის უნდა ყველა მასივის ელემენტი მიამატოს ერთმანეთს(მაგ. 1 + 2 + 3 + 4 + 5) თუ "*" გაამრავლოს (მაგ. 1 * 2 * 3 * 4 * 5)
*/

////// =>> კოდი დაწერეთ აქ
let myArray = [];

function letNumbers(){
myArray.Length = 5;
for (i=0; i < myArray.Length; i++) {
    let a=Number(prompt("ჩაწერე სასურველი რიცხვი.","მაგ.123")); 
    if (isNaN(a)) {
      a=Number(prompt("ჩაწერე მხოლოდ რიცხვი!"));
    }
    myArray.push(+a);
}
}
// შეიქმნა მასივი რიცხვებისთვის

let x;

function letOperator() {
  let operator = prompt("ჩაწერე არითმეტიკული მოქმედება - ან + ან *");
  
  if(operator == "*" || operator == "+" || operator == "-") {
    x = operator;
  }  else{
    operator = prompt("ჩაწერე არითმეტიკული მოქმედება - ან + ან *");
  }
}

// არითმეტიკული მოქმედებებისთვის ცვლადი

letNumbers();
letOperator();
// ფუნქციების გამოძახება

function calculate(myArray, x) {  
  if (x === '+') {
    result = myArray[0] + myArray[1] + myArray[2] + myArray[3] + myArray[4]
  } else if (x === '-') {
    result =  myArray[0] - myArray[1] - myArray[2] - myArray[3] - myArray[4]
  } else if (x === '*') {
    result =  myArray[0] * myArray[1] * myArray[2] * myArray[3] * myArray[4]
  }
 
  return result;
}

document.write(calculate(myArray, x));


// <-------- თანაკვეთა -------#### //

/*
    თქვენი დავალებაა შექმნათ ფუნცქცია რომელიც აბრუნებს ახალ მასივს, მასივი კი შედგება ამ ორი მასივის თანაკვეთისგან (რომელსაც ორივე შეიცავს)
    შექმენით ორი მასივი და გამოიყენეთ იგივე ფუნქცია რომ იპოვოთ ამ ორი მასივის თანანაკვეთა
*/

const Arr1 = [1, 23, 3, 34, 54, 6];
const Arr2 = [23, 3, 123, 34, 43, 4, 41]

////// =>> კოდი დაწერეთ აქ
const intSection = [];
function Intersection()  {
  for (i=0; i < Arr1.length; i++) {
    for (j=0; j < Arr2.length; j++) {
      if (Arr1[i] === Arr2[j]) {
        intSection.push(Arr1[i])
      }
    }
  }
}
Intersection();
console.log(intSection);



//////



// <-------- ასინქრონული ფუნქცია -------#### //

/**
 * შექმენით ასინქრონული ფუნქცია რომელიც დაითვლის ათამდე, 10 წამის განმავლობაში (1++ == 1წმ)
 */


////// =>> კოდი დაწერეთ აქ
function whileLoop() {
  let i = 1;
  
  setInterval(function() {
    if (i <= 10){
        document.write(i++);
    } 
}, 1000);
} 

whileLoop();



//////



// <-------- უდიდესი რიცხვი -------#### //

/**
 * შექმენით ისეთი ფუნქცია რომელიც დაგიბრუნებთ მიწოდებული მასივის უდიდეს რიცხვს
 */


////// =>> კოდი დაწერეთ აქ

function maxMath(Arr1) {
  let max = [];
  for (i = 0; i < Arr1.length; i++ ) {
    if (Arr1[i] > max) {
      max = Arr1[i];
    }
  }
  return max
}

console.log(maxMath(Arr1))

//////



// <-------- პროცენტის გამოთვლა -------#### //

/**
 *  ჩვენ ვაკეთებთ პროგრამას ბანკისთვის სადაც ადამიანს ვთავაზობთ შეიყვანოს თანხა და დროის ოდენობა (თვეში). 
 *  პროცენტი თვეების მიხედვით: 1-6 თვემდე 10%, 6-12 თვემდე 14%, 1წელზე ზემოთ 20%
 *  გამოთვალეთ სულ რამდენი იქნება გადასახდელი პროცენტთან ერთად.
 */

////// =>> კოდი დაწერეთ აქ
let money=prompt("შეიყვანე სასურველი თანხა");
let month=prompt("შეიყვანე თვეების რაოდენობა");

if (month > 0 && month < 7 ) {
  console.log(money * 10 / 100 +money)
} else if (month > 6 && month < 13 ) {
  console.log(money * 14 / 100 +money)
} else if (month > 12) {
  console.log(money * 20 / 100 +money)
}


